doc-update: Updated final tech stack in README and Project Context
